RT-Thread/rt-thread/bsp/apm32/libraries/APM32F10x_Library/Device/Geehy/APM32F10x/Source/iar/startup_apm32f10x_hd.s
;/*!
; * @file        startup_apm32f10x_hd.s
; *
; * @brief       CMSIS Cortex-M3 based Core Device Startup File for Device APM32F103
; *
; * @version     V1.0.0
; *
; * @date        2022-01-05
; *
; * @attention
; *
; *  Copyright (C) 2020-2022 Geehy Semiconductor
; *
; *  You may not use this file except in compliance with the
; *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
; *
; *  The program is only for reference, which is distributed in the hope
; *  that it will be usefull and instructional for customers to develop
; *  their software. Unless required by applicable law or agreed to in
; *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
; *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
; *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
; *  and limitations under the License.
; */

MODULE  ? cstartup

;;
Forward declaration of sections.
SECTION CSTACK:
DATA:
NOROOT(3)

SECTION .intvec:
CODE:
NOROOT(2)


EXTERN  __iar_program_start
EXTERN  SystemInit
PUBLIC  __vector_table

DATA

__vector_table
DCD     sfe(CSTACK)
DCD     Reset_Handler                ;
Reset Handler
DCD     NMI_Handler                  ;
NMI Handler
DCD     HardFault_Handler            ;
Hard Fault Handler
DCD     MemManage_Handler            ;
MPU Fault Handler
DCD     BusFault_Handler             ;
Bus Fault Handler
DCD     UsageFault_Handler           ;
Usage Fault Handler
DCD     0                            ;
Reserved
DCD     0                            ;
Reserved
DCD     0                            ;
Reserved
DCD     0                            ;
Reserved
DCD     SVC_Handler                  ;
SVCall Handler
DCD     DebugMon_Handler             ;
Debug Monitor Handler
DCD     0                            ;
Reserved
DCD     PendSV_Handler               ;
PendSV Handler
DCD     SysTick_Handler              ;
SysTick Handler

;
External Interrupts
DCD     WWDT_IRQHandler              ;
Window Watchdog
DCD     PVD_IRQHandler               ;
PVD through EINT Line detect
DCD     TAMPER_IRQHandler            ;
Tamper
DCD     RTC_IRQHandler               ;
RTC
DCD     FLASH_IRQHandler             ;
Flash
DCD     RCM_IRQHandler               ;
RCM
DCD     EINT0_IRQHandler             ;
EINT Line 0
DCD     EINT1_IRQHandler             ;
EINT Line 1
DCD     EINT2_IRQHandler             ;
EINT Line 2
DCD     EINT3_IRQHandler             ;
EINT Line 3
DCD     EINT4_IRQHandler             ;
EINT Line 4
DCD     DMA1_Channel1_IRQHandler     ;
DMA1 Channel 1
DCD     DMA1_Channel2_IRQHandler     ;
DMA1 Channel 2
DCD     DMA1_Channel3_IRQHandler     ;
DMA1 Channel 3
DCD     DMA1_Channel4_IRQHandler     ;
DMA1 Channel 4
DCD     DMA1_Channel5_IRQHandler     ;
DMA1 Channel 5
DCD     DMA1_Channel6_IRQHandler     ;
DMA1 Channel 6
DCD     DMA1_Channel7_IRQHandler     ;
DMA1 Channel 7
DCD     ADC1_2_IRQHandler            ;
ADC1 &ADC2
DCD     USBD1_HP_CAN1_TX_IRQHandler  ;
USBD1 High Priority or CAN1 TX
DCD     USBD1_LP_CAN1_RX0_IRQHandler ;
USBD1 Low  Priority or CAN1 RX0
DCD     CAN1_RX1_IRQHandler          ;
CAN1 RX1
DCD     CAN1_SCE_IRQHandler          ;
CAN1 SCE
DCD     EINT9_5_IRQHandler           ;
EINT Line 9..5
DCD     TMR1_BRK_IRQHandler          ;
TMR1 Break
DCD     TMR1_UP_IRQHandler           ;
TMR1 Update
DCD     TMR1_TRG_COM_IRQHandler      ;
TMR1 Trigger and Commutation
DCD     TMR1_CC_IRQHandler           ;
TMR1 Capture Compare
DCD     TMR2_IRQHandler              ;
TMR2
DCD     TMR3_IRQHandler              ;
TMR3
DCD     TMR4_IRQHandler              ;
TMR4
DCD     I2C1_EV_IRQHandler           ;
I2C1 Event
DCD     I2C1_ER_IRQHandler           ;
I2C1 Error
DCD     I2C2_EV_IRQHandler           ;
I2C2 Event
DCD     I2C2_ER_IRQHandler           ;
I2C2 Error
DCD     SPI1_IRQHandler              ;
SPI1
DCD     SPI2_IRQHandler              ;
SPI2
DCD     USART1_IRQHandler            ;
USART1
DCD     USART2_IRQHandler            ;
USART2
DCD     USART3_IRQHandler            ;
USART3
DCD     EINT15_10_IRQHandler         ;
EINT Line 15..10
DCD     RTCAlarm_IRQHandler          ;
RTC Alarm through EINT Line
DCD     USBDWakeUp_IRQHandler        ;
USBD Wakeup from suspend
DCD     TMR8_BRK_IRQHandler          ;
TMR8 Break
DCD     TMR8_UP_IRQHandler           ;
TMR8 Update
DCD     TMR8_TRG_COM_IRQHandler      ;
TMR8 Trigger and Commutation
DCD     TMR8_CC_IRQHandler           ;
TMR8 Capture Compare
DCD     ADC3_IRQHandler              ;
ADC3
DCD     EMMC_IRQHandler              ;
EMMC
DCD     SDIO_IRQHandler              ;
SDIO
DCD     TMR5_IRQHandler              ;
TMR5
DCD     SPI3_IRQHandler              ;
SPI3
DCD     UART4_IRQHandler             ;
UART4
DCD     UART5_IRQHandler             ;
UART5
DCD     TMR6_IRQHandler              ;
TMR6
DCD     TMR7_IRQHandler              ;
TMR7
DCD     DMA2_Channel1_IRQHandler     ;
DMA2 Channel1
DCD     DMA2_Channel2_IRQHandler     ;
DMA2 Channel2
DCD     DMA2_Channel3_IRQHandler     ;
DMA2 Channel3
DCD     DMA2_Channel4_5_IRQHandler   ;
DMA2 Channel4 &Channel5
DCD     0                            ;
Reserved
DCD     USBD2_HP_CAN2_TX_IRQHandler  ;
USBD2 High Priority or CAN2 TX
DCD     USBD2_LP_CAN2_RX0_IRQHandler ;
USBD2 Low  Priority or CAN2 RX0
DCD     CAN2_RX1_IRQHandler          ;
CAN2 RX1
DCD     CAN2_SCE_IRQHandler          ;
CAN2 SCE
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;;
Default interrupt handlers.
;;
THUMB

PUBWEAK Reset_Handler
SECTION .text:
CODE:
REORDER:
NOROOT(2)
Reset_Handler
LDR     R0, = SystemInit
              BLX     R0
              LDR     R0, = __iar_program_start
                            BX      R0

                            PUBWEAK NMI_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            NMI_Handler
                            B NMI_Handler

                            PUBWEAK HardFault_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            HardFault_Handler
                            B HardFault_Handler

                            PUBWEAK MemManage_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            MemManage_Handler
                            B MemManage_Handler

                            PUBWEAK BusFault_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            BusFault_Handler
                            B BusFault_Handler

