RT-Thread/rt-thread/bsp/apm32/libraries/APM32F10x_Library/Device/Geehy/APM32F10x/Source/iar/startup_apm32f10x_hd.s
                            PUBWEAK UsageFault_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            UsageFault_Handler
                            B UsageFault_Handler

                            PUBWEAK SVC_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            SVC_Handler
                            B SVC_Handler

                            PUBWEAK DebugMon_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DebugMon_Handler
                            B DebugMon_Handler

                            PUBWEAK PendSV_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            PendSV_Handler
                            B PendSV_Handler

                            PUBWEAK SysTick_Handler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            SysTick_Handler
                            B SysTick_Handler

                            PUBWEAK WWDT_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            WWDT_IRQHandler
                            B WWDT_IRQHandler

                            PUBWEAK PVD_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            PVD_IRQHandler
                            B PVD_IRQHandler

                            PUBWEAK TAMPER_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TAMPER_IRQHandler
                            B TAMPER_IRQHandler

                            PUBWEAK RTC_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            RTC_IRQHandler
                            B RTC_IRQHandler

                            PUBWEAK FLASH_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            FLASH_IRQHandler
                            B FLASH_IRQHandler

                            PUBWEAK RCM_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            RCM_IRQHandler
                            B RCM_IRQHandler

                            PUBWEAK EINT0_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            EINT0_IRQHandler
                            B EINT0_IRQHandler

                            PUBWEAK EINT1_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            EINT1_IRQHandler
                            B EINT1_IRQHandler

                            PUBWEAK EINT2_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            EINT2_IRQHandler
                            B EINT2_IRQHandler

                            PUBWEAK EINT3_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            EINT3_IRQHandler
                            B EINT3_IRQHandler

                            PUBWEAK EINT4_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            EINT4_IRQHandler
                            B EINT4_IRQHandler

                            PUBWEAK DMA1_Channel1_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA1_Channel1_IRQHandler
                            B DMA1_Channel1_IRQHandler

                            PUBWEAK DMA1_Channel2_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA1_Channel2_IRQHandler
                            B DMA1_Channel2_IRQHandler

                            PUBWEAK DMA1_Channel3_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA1_Channel3_IRQHandler
                            B DMA1_Channel3_IRQHandler

                            PUBWEAK DMA1_Channel4_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA1_Channel4_IRQHandler
                            B DMA1_Channel4_IRQHandler

                            PUBWEAK DMA1_Channel5_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA1_Channel5_IRQHandler
                            B DMA1_Channel5_IRQHandler

                            PUBWEAK DMA1_Channel6_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA1_Channel6_IRQHandler
                            B DMA1_Channel6_IRQHandler

