RT-Thread/rt-thread/bsp/apm32/libraries/APM32F10x_Library/Device/Geehy/APM32F10x/Source/iar/startup_apm32f10x_hd.s
                            PUBWEAK DMA1_Channel7_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA1_Channel7_IRQHandler
                            B DMA1_Channel7_IRQHandler

                            PUBWEAK ADC1_2_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            ADC1_2_IRQHandler
                            B ADC1_2_IRQHandler

                            PUBWEAK USBD1_HP_CAN1_TX_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            USBD1_HP_CAN1_TX_IRQHandler
                            B USBD1_HP_CAN1_TX_IRQHandler

                            PUBWEAK USBD1_LP_CAN1_RX0_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            USBD1_LP_CAN1_RX0_IRQHandler
                            B USBD1_LP_CAN1_RX0_IRQHandler

                            PUBWEAK CAN1_RX1_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            CAN1_RX1_IRQHandler
                            B CAN1_RX1_IRQHandler

                            PUBWEAK CAN1_SCE_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            CAN1_SCE_IRQHandler
                            B CAN1_SCE_IRQHandler

                            PUBWEAK EINT9_5_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            EINT9_5_IRQHandler
                            B EINT9_5_IRQHandler

                            PUBWEAK TMR1_BRK_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR1_BRK_IRQHandler
                            B TMR1_BRK_IRQHandler

                            PUBWEAK TMR1_UP_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR1_UP_IRQHandler
                            B TMR1_UP_IRQHandler

                            PUBWEAK TMR1_TRG_COM_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR1_TRG_COM_IRQHandler
                            B TMR1_TRG_COM_IRQHandler

                            PUBWEAK TMR1_CC_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR1_CC_IRQHandler
                            B TMR1_CC_IRQHandler

                            PUBWEAK TMR2_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR2_IRQHandler
                            B TMR2_IRQHandler

                            PUBWEAK TMR3_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR3_IRQHandler
                            B TMR3_IRQHandler

                            PUBWEAK TMR4_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR4_IRQHandler
                            B TMR4_IRQHandler

                            PUBWEAK I2C1_EV_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            I2C1_EV_IRQHandler
                            B I2C1_EV_IRQHandler

                            PUBWEAK I2C1_ER_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            I2C1_ER_IRQHandler
                            B I2C1_ER_IRQHandler

                            PUBWEAK I2C2_EV_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            I2C2_EV_IRQHandler
                            B I2C2_EV_IRQHandler

                            PUBWEAK I2C2_ER_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            I2C2_ER_IRQHandler
                            B I2C2_ER_IRQHandler

                            PUBWEAK SPI1_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            SPI1_IRQHandler
                            B SPI1_IRQHandler

                            PUBWEAK SPI2_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            SPI2_IRQHandler
                            B SPI2_IRQHandler

                            PUBWEAK USART1_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            USART1_IRQHandler
                            B USART1_IRQHandler

                            PUBWEAK USART2_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            USART2_IRQHandler
                            B USART2_IRQHandler

                            PUBWEAK USART3_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            USART3_IRQHandler
                            B USART3_IRQHandler

                            PUBWEAK EINT15_10_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            EINT15_10_IRQHandler
                            B EINT15_10_IRQHandler

                            PUBWEAK RTCAlarm_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            RTCAlarm_IRQHandler
                            B RTCAlarm_IRQHandler

                            PUBWEAK USBDWakeUp_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            USBDWakeUp_IRQHandler
                            B USBDWakeUp_IRQHandler

