RT-Thread/rt-thread/bsp/apm32/libraries/APM32F10x_Library/Device/Geehy/APM32F10x/Source/iar/startup_apm32f10x_hd.s
                            PUBWEAK TMR8_BRK_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR8_BRK_IRQHandler
                            B TMR8_BRK_IRQHandler

                            PUBWEAK TMR8_UP_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR8_UP_IRQHandler
                            B TMR8_UP_IRQHandler

                            PUBWEAK TMR8_TRG_COM_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR8_TRG_COM_IRQHandler
                            B TMR8_TRG_COM_IRQHandler

                            PUBWEAK TMR8_CC_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR8_CC_IRQHandler
                            B TMR8_CC_IRQHandler

                            PUBWEAK ADC3_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            ADC3_IRQHandler
                            B ADC3_IRQHandler

                            PUBWEAK EMMC_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            EMMC_IRQHandler
                            B EMMC_IRQHandler

                            PUBWEAK SDIO_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            SDIO_IRQHandler
                            B SDIO_IRQHandler

                            PUBWEAK TMR5_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR5_IRQHandler
                            B TMR5_IRQHandler

                            PUBWEAK SPI3_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            SPI3_IRQHandler
                            B SPI3_IRQHandler

                            PUBWEAK UART4_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            UART4_IRQHandler
                            B UART4_IRQHandler

                            PUBWEAK UART5_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            UART5_IRQHandler
                            B UART5_IRQHandler

                            PUBWEAK TMR6_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR6_IRQHandler
                            B TMR6_IRQHandler

                            PUBWEAK TMR7_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            TMR7_IRQHandler
                            B TMR7_IRQHandler

                            PUBWEAK DMA2_Channel1_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA2_Channel1_IRQHandler
                            B DMA2_Channel1_IRQHandler

                            PUBWEAK DMA2_Channel2_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA2_Channel2_IRQHandler
                            B DMA2_Channel2_IRQHandler

                            PUBWEAK DMA2_Channel3_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA2_Channel3_IRQHandler
                            B DMA2_Channel3_IRQHandler

                            PUBWEAK DMA2_Channel4_5_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            DMA2_Channel4_5_IRQHandler
                            B DMA2_Channel4_5_IRQHandler

                            PUBWEAK USBD2_HP_CAN2_TX_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            USBD2_HP_CAN2_TX_IRQHandler
                            B USBD2_HP_CAN2_TX_IRQHandler

                            PUBWEAK USBD2_LP_CAN2_RX0_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            USBD2_LP_CAN2_RX0_IRQHandler
                            B USBD2_LP_CAN2_RX0_IRQHandler

                            PUBWEAK CAN2_RX1_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            CAN2_RX1_IRQHandler
                            B CAN2_RX1_IRQHandler

                            PUBWEAK CAN2_SCE_IRQHandler
                            SECTION .text:
                            CODE:
                            REORDER:
                            NOROOT(1)
                            CAN2_SCE_IRQHandler
                            B CAN2_SCE_IRQHandler

                            END

